qanda/app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(answer_params)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 2 LIMIT 1
INSERT INTO "answers" ("name", "content", "question_id", "created_at", "updated_at") VALUES ('kota', 'fadjhgkygkaygfas', 2, '2026-05-03 12:03:29.406436', '2026-05-03 12:03:29.406436') RETURNING "id"

  def destroy
    @question = Question.find(params[:question_id])
    @answer = @question.answers.find(params[:id])
    @answer.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 2 LIMIT 1
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 2 AND "answers"."id" = 1 LIMIT 1
DELETE FROM "answers" WHERE "answers"."id" = 1