qanda/app/controllers/questions_controller.rb

INSERT INTO "questions" ("name", "title", "content", "created_at", "updated_at") VALUES ('nsjgbslkgb', 'dkoajfa', 'anlgbfsgblalhalfjhjfas', '2026-05-03 10:59:43.600088', '2026-05-03 10:59:43.600088') RETURNING "id"
---
  def create
    #Questionモデルを初期化
    @question = Question.new(question_params)
    #Questionモデルを保存
    if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = 1 LIMIT 1
UPDATE "questions" SET "name" = 'sdadaasda', "content" = 'cccssss', "updated_at" = '2026-05-03 11:16:07.975797' WHERE "questions"."id" = 1
---
  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)